package niuke.度小满.最短路;

/**
 * @创建人：Administrator
 * @备注：
 */
/**
 *西西所在的国家有N座城市，每座城市都有一道传送门，城市 i 的传送门通往城市 a[i]。当西西位于城市 i 时，每次他可以执行以下三种操作中的一种：
 *
 *花费 A 的费用，从城市 i 前往城市 a[i]；
 *
 *如果 a[i] > 1，可以花费 B 的费用，将 a[i] 的值减少 1；
 *
 *如果 a[i] < N，可以花费 C 的费用，将 a[i] 的值增加 1。
 *
 *现在，西西想从城市 1 前往城市 N，那么他至少要花费多少费用？

 *input：
 *  第一行输入四个整数 N、A、B、C（1 < N <= 10000，1 <= A、B、C <= 100000）。
 *
 * 第二行输入 N 个整数 a[1] 到 a[N]（1 <= a[i] <= N）。
 *
 *output:
 * 输出一个整数，表示从城市 1 前往城市 N 所花费的最少费用。
 *
 * sample:
 * 7  1  1  1
 * 3  6  4  3  4  5  6

 *  output
 *    4
 */
public class MAIN3 {
}
